In [5]:
import numpy as np #import bibliotek numpy i pandas
import pandas as pd

In [45]:
df_people = pd.read_csv('../../Pliki/02_pandas/people.csv') #zaczytanie pliku .csv people + utworzenie zmiennej df_people
df_people.head() # pokaznie tylko 5 rekordów

      Name  Age       Location Occupation  Salary
0    Alice   28       New York   Engineer   80000
1      Bob   35    Los Angeles     Doctor  120000
2  Charlie   22        Chicago    Student       0
3    David   40  San Francisco    Manager   95000
4    Emily   29          Miami   Designer   75000

In [46]:
df_people['Length in cm'] = [178, 179, 182, 190, 189, 176, 165, 156, 166, 180, 165, 190, 201, 160, 179, 191]
# dodanie kolumny 'Length in cm' i 'age'
df_people['age'] = [78, 79, 82, 90, 34, 23, 65, 56, 18, 23, 33, 45, 19, 46, 24, 31]
df_people

       Name  Age       Location      Occupation  Salary  Length in cm  age
0     Alice   28       New York        Engineer   80000           178   78
1       Bob   35    Los Angeles          Doctor  120000           179   79
2   Charlie   22        Chicago         Student       0           182   82
3     David   40  San Francisco         Manager   95000           190   90
4     Emily   29          Miami        Designer   75000           189   34
5     Frank   32         Boston         Teacher   60000           176   23
6     Grace   27        Seattle       Scientist  110000           165   65
7    Hannah   45         Dallas          Lawyer  130000           156   56
8       Ian   31         Denver          Writer   70000           166   18
9     Julia   24         Austin          Artist   55000           180   23
10    Karen   38        Houston      Accountant   90000           165   33
11     Liam   26        Phoenix    Photographer   50000           190   45
12    Megan   33       Portland       Architect  105000           201   19
13   Nathan   29        Atlanta        Musician   40000           160   46
14   Olivia   27        Detroit            Chef   65000           179   24
15     Paul   36    Minneapolis  Police Officer   85000           191   31

In [47]:
df_people.drop('age', axis=1) #dropnięcie kolumny 'age'

       Name  Age       Location      Occupation  Salary  Length in cm
0     Alice   28       New York        Engineer   80000           178
1       Bob   35    Los Angeles          Doctor  120000           179
2   Charlie   22        Chicago         Student       0           182
3     David   40  San Francisco         Manager   95000           190
4     Emily   29          Miami        Designer   75000           189
5     Frank   32         Boston         Teacher   60000           176
6     Grace   27        Seattle       Scientist  110000           165
7    Hannah   45         Dallas          Lawyer  130000           156
8       Ian   31         Denver          Writer   70000           166
9     Julia   24         Austin          Artist   55000           180
10    Karen   38        Houston      Accountant   90000           165
11     Liam   26        Phoenix    Photographer   50000           190
12    Megan   33       Portland       Architect  105000           201
13   Nathan   29        Atlanta        Musician   40000           160
14   Olivia   27        Detroit            Chef   65000           179
15     Paul   36    Minneapolis  Police Officer   85000           191

In [48]:
df_people # jak widać jeszcze ta kolumna 'age' mimo usunięcia jest jeszcze widoczna

       Name  Age       Location      Occupation  Salary  Length in cm  age
0     Alice   28       New York        Engineer   80000           178   78
1       Bob   35    Los Angeles          Doctor  120000           179   79
2   Charlie   22        Chicago         Student       0           182   82
3     David   40  San Francisco         Manager   95000           190   90
4     Emily   29          Miami        Designer   75000           189   34
5     Frank   32         Boston         Teacher   60000           176   23
6     Grace   27        Seattle       Scientist  110000           165   65
7    Hannah   45         Dallas          Lawyer  130000           156   56
8       Ian   31         Denver          Writer   70000           166   18
9     Julia   24         Austin          Artist   55000           180   23
10    Karen   38        Houston      Accountant   90000           165   33
11     Liam   26        Phoenix    Photographer   50000           190   45
12    Megan   33       Portland       Architect  105000           201   19
13   Nathan   29        Atlanta        Musician   40000           160   46
14   Olivia   27        Detroit            Chef   65000           179   24
15     Paul   36    Minneapolis  Police Officer   85000           191   31

In [49]:
df_people = df_people.drop('age', axis=1) # wyświetlenie stanu tabeli po usunięciu kolumny 'age'
df_people

       Name  Age       Location      Occupation  Salary  Length in cm
0     Alice   28       New York        Engineer   80000           178
1       Bob   35    Los Angeles          Doctor  120000           179
2   Charlie   22        Chicago         Student       0           182
3     David   40  San Francisco         Manager   95000           190
4     Emily   29          Miami        Designer   75000           189
5     Frank   32         Boston         Teacher   60000           176
6     Grace   27        Seattle       Scientist  110000           165
7    Hannah   45         Dallas          Lawyer  130000           156
8       Ian   31         Denver          Writer   70000           166
9     Julia   24         Austin          Artist   55000           180
10    Karen   38        Houston      Accountant   90000           165
11     Liam   26        Phoenix    Photographer   50000           190
12    Megan   33       Portland       Architect  105000           201
13   Nathan   29        Atlanta        Musician   40000           160
14   Olivia   27        Detroit            Chef   65000           179
15     Paul   36    Minneapolis  Police Officer   85000           191

In [44]:
df_people

       Name  Age       Location      Occupation  Salary  Length in cm
0     Alice   28       New York        Engineer   80000           178
1       Bob   35    Los Angeles          Doctor  120000           179
2   Charlie   22        Chicago         Student       0           182
3     David   40  San Francisco         Manager   95000           190
4     Emily   29          Miami        Designer   75000           189
5     Frank   32         Boston         Teacher   60000           176
6     Grace   27        Seattle       Scientist  110000           165
7    Hannah   45         Dallas          Lawyer  130000           156
8       Ian   31         Denver          Writer   70000           166
9     Julia   24         Austin          Artist   55000           180
10    Karen   38        Houston      Accountant   90000           165
11     Liam   26        Phoenix    Photographer   50000           190
12    Megan   33       Portland       Architect  105000           201
13   Nathan   29        Atlanta        Musician   40000           160
14   Olivia   27        Detroit            Chef   65000           179
15     Paul   36    Minneapolis  Police Officer   85000           191

In [50]:
df_people.info() # Dzięki metody 'info' możemy sobie zobaczyć jakie typy kolumn są uzyte w tej bazie (jakie metryki są przypisane do kolumn) w naszym data frame 'df_house'.
# I teraz kolumna 'non-null' pokazuje ile wierszy nie jest pustych. Jak widać mamy różnice, co oznacza, że w niektórych wierszach brakuje nam wartości. Jeśli wartość jest ta sama dla wszystkich wierszy, to jest ok, ale jeśli dla któregoś jest inna, tzn. że tam są wartości puste, czyli brakuje wartości.
# W kolumnie 'Dtype' mamy jakie rodzaje typów wartości są w nich zawarte, i tak object = string, a inne już mają standardowe nazwy.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16 non-null     object
 1   Age           16 non-null     int64
 2   Location      16 non-null     object
 3   Occupation    16 non-null     object
 4   Salary        16 non-null     int64
 5   Length in cm  16 non-null     int64
dtypes: int64(3), object(3)
memory usage: 896.0+ bytes

In [51]:
df_people.isna().sum() # dzięki tej metody 'isna()' możemy zobaczyć ile w rzeczywistości brakuje wierszy w danych kolumnach, ktore następnie sumujemy .sum(), zeby mieć pełny obraz.  W tej bazie nie brakuje żadnych.

Name            0
Age             0
Location        0
Occupation      0
Salary          0
Length in cm    0
dtype: int64

In [52]:
pd.set_option('display.float.format', lambda x: '%.5f' % x) # tutaj ustawiamy flagę dla Pandas, o nazwie 'display.float.format' + tu korzystamy z 'lambdy', aby każdy z tych wierszy był wyswietlany jako wartość dziesiętna, z 5 miejscami po przecinku

In [53]:
df_people.describe() # Bardzo przydatna Funkcja'describe' - za pomocą której wyświetlamy podstawowe statystyki, gdzie mamy zawarte wszystkie numeryczne kolumny. Dzięki temu zobaczymy, czy nie ma jakichś złych danych, np.min cena za 1m2=2grosze, zaś cena max=ponad 9mln zł.

           Age       Salary  Length in cm
count 16.00000     16.00000      16.00000
mean  31.37500  76875.00000     177.93750
std    6.18466  32755.40668      12.70941
min   22.00000      0.00000     156.00000
25%   27.00000  58750.00000     165.75000
50%   30.00000  77500.00000     179.00000
75%   35.25000  97500.00000     189.25000
max   45.00000 130000.00000     201.00000

In [54]:
df_people.describe(include='object') # teraz wyświetlamy podstawowe statystyki, gdzie mamy zawarte wszystkie tekstowe (object) kolumny

         Name  Location Occupation
count      16        16         16
unique     16        16         16
top     Alice  New York   Engineer
freq        1         1          1

In [79]:
df_people.sort_values('Age') # tu sortujemy po ludzi po wieku

     Name  Age       Location      Occupation  Salary  Length in cm
6   Grace   27        Seattle       Scientist  110000           165
0   Alice   28       New York        Engineer   80000           178
4   Emily   29          Miami        Designer   75000           189
12  Megan   33       Portland       Architect  105000           201
1     Bob   35    Los Angeles          Doctor  120000           179
15   Paul   36    Minneapolis  Police Officer   85000           191
10  Karen   38        Houston      Accountant   90000           165
3   David   40  San Francisco         Manager   95000           190

In [63]:
df_people.sort_values('Salary', ascending=False) # tu sobie sortujemy po zarobkach, ale od największych, do najmniejszych

     Name  Age       Location      Occupation  Salary  Length in cm
1     Bob   35    Los Angeles          Doctor  120000           179
6   Grace   27        Seattle       Scientist  110000           165
12  Megan   33       Portland       Architect  105000           201
3   David   40  San Francisco         Manager   95000           190
10  Karen   38        Houston      Accountant   90000           165
15   Paul   36    Minneapolis  Police Officer   85000           191
0   Alice   28       New York        Engineer   80000           178
4   Emily   29          Miami        Designer   75000           189

In [83]:
df_people = df_people[(df_people['Salary'] > 70000) & (df_people['Salary'] < 130000 )] #zawężanie zakresu zarobków
df_people

     Name  Age       Location      Occupation  Salary  Length in cm
0   Alice   28       New York        Engineer   80000           178
1     Bob   35    Los Angeles          Doctor  120000           179
3   David   40  San Francisco         Manager   95000           190
4   Emily   29          Miami        Designer   75000           189
6   Grace   27        Seattle       Scientist  110000           165
10  Karen   38        Houston      Accountant   90000           165
12  Megan   33       Portland       Architect  105000           201
15   Paul   36    Minneapolis  Police Officer   85000           191

In [84]:
df_people.sort_values('Salary') # sortowanie po zawężeniu zarobków, od najmniejszego, do największego

     Name  Age       Location      Occupation  Salary  Length in cm
4   Emily   29          Miami        Designer   75000           189
0   Alice   28       New York        Engineer   80000           178
15   Paul   36    Minneapolis  Police Officer   85000           191
10  Karen   38        Houston      Accountant   90000           165
3   David   40  San Francisco         Manager   95000           190
12  Megan   33       Portland       Architect  105000           201
6   Grace   27        Seattle       Scientist  110000           165
1     Bob   35    Los Angeles          Doctor  120000           179

In [85]:
df_people.describe() # teraz widzimy statystyki po zawężeniu odnośnie 'Salary'

           Age       Salary  Length in cm
count  8.00000      8.00000       8.00000
mean  33.25000  95000.00000     182.25000
std    4.83292  15583.87445      12.85913
min   27.00000  75000.00000     165.00000
25%   28.75000  83750.00000     174.75000
50%   34.00000  92500.00000     184.00000
75%   36.50000 106250.00000     190.25000
max   40.00000 120000.00000     201.00000

### EKSPLORACJA DANYCH, poszukiwanie różnych specyficznych danych, SCHEMATÓW

In [86]:
df_people['Salary'].value_counts() #tu za pomocą funkcji '.value_counts' możemy z danej kolumny wyciągnąć istniejące tam różne dane i je następnie zsumować

Salary
80000     1
120000    1
95000     1
75000     1
110000    1
90000     1
105000    1
85000     1
Name: count, dtype: int64